# FROM - указывает базовый образ, в данном случае, Node.js
FROM node 

# WORKDIR - устанавливает рабочую директорию внутри папки
WORKDIR /app

# COPY - Копируем все файлы (первая тчока так как мы и находимся в корне проекта .) в рабочую директорию (вторая точка . так как и копируем их туда же)
COPY . .

# RUN - выполняет команду npm install для установки зависимостей
RUN npm install

# !Схера ли?
RUN npm rebuild bcrypt --build-from-source


# EXPOSE - объявляет порт 3000, который контейнер будет слушать
EXPOSE 3000

# CMD - команда, которая будет выполнена при запуске контейнера
CMD ["node", "server.js"]

# Копируем файлы package.json и package-lock.json в рабочую директорию
# COPY package*.json ./








